public class Main {
    public static void main(String[] args) {

        // Домашнее задание 1
        // Задача 1
       // Person max = new Person();
       // max.name = "Максим";
        // max.yearOfBirth = 1988;
        //max.town = "Минск";
        //System.out.println("Привет! Меня зовут " + max.name + "." + " Я из города " + max.town + "." + " Я родился в " + max.yearOfBirth + " году. Будем знакомы!");
        //Person anya = new Person();
        //anya.name = "Аня";
        //anya.yearOfBirth = 1993;
        //anya.town = "Москва";
        //System.out.println("Привет! Меня зовут " + anya.name + "." + " Я из города " + anya.town + "." + " Я родился в " + anya.yearOfBirth + " году. Будем знакомы!");
        //Person katya = new Person();
        //katya.name = "Kaтя";
        //katya.yearOfBirth = 1992;
        //katya.town = "Калининград";
        //System.out.println("Привет! Меня зовут " + katya.name + "." + " Я из города " + katya.town + "." + " Я родился в " + katya.yearOfBirth + " году. Будем знакомы!");
        //Person artem = new Person();
        //artem.name = "Артём";
        //artem.yearOfBirth = 1995;
        //artem.town = "Москва";
        //System.out.println("Привет! Меня зовут " + artem.name + "." + " Я из города " + artem.town + "." + " Я родился в " + artem.yearOfBirth + " году. Будем знакомы!");

        // Задача 2
        //max.jobTitle = "бренд-менеджер";
        //anya.jobTitle = "методист образовательных программ";
        //katya.jobTitle = "продакт-менеджер";
        //artem.jobTitle = "директор по развитию бизнеса";
        //System.out.println("Привет! Меня зовут " + max.name + "." + " Я из города " + max.town + "." + " Я родился в " + max.yearOfBirth + " году. Я работаю на должности " + max.jobTitle + ". Будем знакомы!");
        //System.out.println("Привет! Меня зовут " + anya.name + "." + " Я из города " + anya.town + "." + " Я родился в " + anya.yearOfBirth + " году. Я работаю на должности " + anya.jobTitle + ". Будем знакомы!");
        //System.out.println("Привет! Меня зовут " + katya.name + "." + " Я из города " + katya.town + "." + " Я родился в " + katya.yearOfBirth + " году. Я работаю на должности " + katya.jobTitle + ". Будем знакомы!");
        //System.out.println("Привет! Меня зовут " + artem.name + "." + " Я из города " + artem.town + "." + " Я родился в " + artem.yearOfBirth + " году. Я работаю на должности " + artem.jobTitle + ". Будем знакомы!");

        // Задача 3
        //Car granta = new Car();
       // granta.brand = "Lada";
        //granta.model = "Granta";
        //granta.engineVolume = 1.7;
        //granta.colour = "жёлтый";
        //granta.country = "Россия";
        //granta.year = 2015;
        //System.out.println(granta.brand + " " + granta.model + ", объём двигателя - " + granta.engineVolume + " литра, год выпуска - " + granta.year + ", цвет - " + granta.colour + ", страна - " + granta.country + ".");

        //Car audi = new Car();
        //audi.brand = "Audi";
        //audi.model = "A8 50 L TDI quattro";
       // audi.engineVolume = 3.0;
       // audi.colour = "чёрный";
       // audi.country = "Германия";
        //audi.year = 2020;
        //System.out.println(audi.brand + " " + audi.model + ", объём двигателя - " + audi.engineVolume + " литра, год выпуска - " + audi.year + ", цвет - " + audi.colour + ", страна - " + audi.country + ".");

        //Car bmw = new Car();
       // bmw.brand = "BMW";
       // bmw.model = "Z8";
      //  bmw.engineVolume = 3.0;
      //  bmw.colour = "чёрный";
       // bmw.country = "Германия";
       // bmw.year = 2021;
        //System.out.println(bmw.brand + " " + bmw.model + ", объём двигателя - " + bmw.engineVolume + " литра, год выпуска - " + bmw.year + ", цвет - " + bmw.colour + ", страна - " + bmw.country + ".");

        //Car kia = new Car();
       // kia.brand = "KIA";
       // kia.model = "Sportage 4-го поколения";
       // kia.engineVolume = 2.4;
       // kia.colour = "красный";
        //kia.country = "Южная Корея";
        //kia.year = 2018;
        //System.out.println(kia.brand + " " + kia.model + ", объём двигателя - " + kia.engineVolume + " литра, год выпуска - " + kia.year + ", цвет - " + kia.colour + ", страна - " + kia.country + ".");

        //Car hyundai = new Car();
        //hyundai.brand = "Hyundai";
        //hyundai.model = "Avante";
        //hyundai.engineVolume = 1.6;
        //hyundai.colour = "оранжевый";
        //hyundai.country = "Южная Корея";
       // hyundai.year = 2016;
       // System.out.println(hyundai.brand + " " + hyundai.model + ", объём двигателя - " + hyundai.engineVolume + " литра, год выпуска - " + hyundai.year + ", цвет - " + hyundai.colour + ", страна - " + hyundai.country + ".");


        // Домашнее задание 2
        // Задача 1
        Person max1 = new Person(1988, "Максим", "Минск", "бренд-менеджер");
        Person anya1 = new Person(1993, "Аня", "Москва", "методист образовательных программ");
        Person katya1 = new Person(1992, "Катя", "Калининград", "продакт-менеджер");
        Person artem1 = new Person(1995, "Артём", "Москва", "директор по развитию бизнеса");

        // Задача 2

        Car granta1 = new Car("Lada", "Granta", 1.7, "жёлтый", 2015, "Россия");
        Car audi1 = new Car("Audi", "A8 50 L TDI quattro", 3.0, "чёрный", 2020, "Германия");
        Car bmw1 = new Car("BMW", "Z8", 3.0, "чёрный", 2021, "Германия");
        Car kia1 = new Car("KIA", "Sportage 4-го поколения", 2.4, "красный", 2018, "Южная Корея");
        Car hyundai1 = new Car(null, "Avante", 0, null, 2016, "Южная Корея");

        System.out.println("Привет! Меня зовут " + max1.name + "." + " Я из города " + max1.town + "." + " Я родился в " + max1.yearOfBirth + " году. Я работаю на должности " + max1.jobTitle + ". Будем знакомы!");
        System.out.println("Привет! Меня зовут " + anya1.name + "." + " Я из города " + anya1.town + "." + " Я родился в " + anya1.yearOfBirth + " году. Я работаю на должности " + anya1.jobTitle + ". Будем знакомы!");
        System.out.println("Привет! Меня зовут " + katya1.name + "." + " Я из города " + katya1.town + "." + " Я родился в " + katya1.yearOfBirth + " году. Я работаю на должности " + katya1.jobTitle + ". Будем знакомы!");
        System.out.println("Привет! Меня зовут " + artem1.name + "." + " Я из города " + artem1.town + "." + " Я родился в " + artem1.yearOfBirth + " году. Я работаю на должности " + artem1.jobTitle + ". Будем знакомы!");

        System.out.println(hyundai1.brand + " " + hyundai1.model + ", объём двигателя - " + hyundai1.engineVolume + " литра, год выпуска - " + hyundai1.year + ", цвет - " + hyundai1.colour + ", страна - " + hyundai1.country + ".");
        System.out.println(granta1.brand + " " + granta1.model + ", объём двигателя - " + granta1.engineVolume + " литра, год выпуска - " + granta1.year + ", цвет - " + granta1.colour + ", страна - " + granta1.country + ".");
        System.out.println(audi1.brand + " " + audi1.model + ", объём двигателя - " + audi1.engineVolume + " литра, год выпуска - " + audi1.year + ", цвет - " + audi1.colour + ", страна - " + audi1.country + ".");
        System.out.println(bmw1.brand + " " + bmw1.model + ", объём двигателя - " + bmw1.engineVolume + " литра, год выпуска - " + bmw1.year + ", цвет - " + bmw1.colour + ", страна - " + bmw1.country + ".");
        System.out.println(kia1.brand + " " + kia1.model + ", объём двигателя - " + kia1.engineVolume + " литра, год выпуска - " + kia1.year + ", цвет - " + kia1.colour + ", страна - " + kia1.country + ".");

    }
}
